GAN/PermCal/batchCal/sand_org/sand_1319/a/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    fixedWalls
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }

    left
    {
        
        type            fixedValue;
        value			uniform (0 0 0);
    }
    
    right
    {
        
        type            fixedValue;
        value			uniform (0 0 0);
    }
    
    bottom
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
